/* EditExpenseVC assertion check
   EditExpenseVC check for no description text in prepare for segue
   EditExpenseVC check for no description text when done button pressed
   EditExpenseVC text for description label
   Found expense cell no descrition text
   SelectedCategoryVC when expenseDescription.length == 0 show (No description) */
"(No Description)" = "(No Description)";

/* Navigation item title text, add category ManageCAtegoryVC */
"Add Category" = "Add Category";

/* AddCategoryVC succes text for show
   Successful added message in AddExpenseVC */
"Added" = "Added";

/* Title for header, when show all expenses for month */
"All transactions for month" = "All transactions for month";

/* Categories title for header in SearchVC */
"Categories" = "Categories";

/* AddExpnseVC succes text when category added */
"Category added" = "Category added";

/* AddCategorVC message for KVNProgress showWithError
   AddExpenseVC error message when category already exist */
"Category already exist" = "Category already exist";

/* ChooseCategoryVC header title for change category section */
"Change the category of expense." = "Change the category of expense.";

/* ChooseCategoryVC header title for pick icon section */
"Change the icon of category." = "Change the icon of category.";

/* Failure choose category message in AddExpenseVC */
"Choose category" = "Choose category";

/* Day */
"Day" = "Day";

/* CategoriesVC show message when category deleted
   Successful deleted message in DetailVC */
"Deleted" = "Deleted";

/* Navigation item title text, ManageCategoryVC */
"Edit Category" = "Edit Category";

/* End date, selected category view controller */
"End date" = "End date";

/* Failure enter amount of expense message in AddExpenseVC */
"Enter the amount of expense" = "Enter the amount of expense";

/* Failure enter data message in AddExpenseVC */
"Enter the data" = "Enter the data";

/* SelectedCategoryVC title for header in section */
"Founded transactions." = "Founded transactions.";

/* HSDatePickerViewController backButtonTitle */
"Back" = "Back";

/* HSDatePickerViewController confirmButtonTitle */
"Set Date" = "Set Date";

/* ChooseCategoryVC icon label */
"Icon" = "Icon";

/* Month */
"Month" = "Month";

/* Nothing found text for nothing found cell in SearchVC */
"Nothing found" = "Nothing found";

/* 'Nothing found' title for header in section */
"Nothing found." = "Nothing found.";

/* SelectedCategoryVC title for header in section */
"Period of the transactions." = "Period of the transactions.";

/* Placeholder text in search bar of SearchVC */
"Search for expense" = "Search for expense";

/* Start date, selected category view controller */
"Start date" = "Start date";

/* 'Today' text in -formatDate:
   Today in title for header ins section */
"Today" = "Today";

/* Transactions title for header in SearchVC */
"Transactions" = "Transactions";

/* AddCategoryVC update category text
   Successful update message in DetailVC */
"Updated" = "Updated";

/* Year */
"Year" = "Year";

/* Database eror */
"Database eror" = "Database eror";

/* Delete transaction alert view title in DetailExpenseVC */
"Delete transaction?" = "Delete transaction?";

/* Cancel button title in DetailExpenseVC */
"No" = "No";

/* Delete transaction alert view other button title in DetailExpenseVC */
"Delete" = "Delete";

/*
 UNIVERSAL PARTS
 */
"SMILE_REASON" = "Touch to enter the application.";
"SMILE_INPUT_FAILED" = "%ld Failed Passcode Attempt. Try again.";
"SMILE_INPUT_DESCRIPTION" = "Enter %ld digit passcode";
"SMILE_INPUT_NOT_MATCH" = "Passcode not match. Try again.";
"SMILE_INPUT_RE-ENTER" = "Re-enter your %ld digit Passcode";

/*
 INPUT_TOUCHID
 */
"SMILE_INPUT_TOUCHID_TITLE" = "ToThePenny";


/*
 INPUT_ONCE
 */
"SMILE_INPUT_ONCE_TITLE" = "Turn off Passcode";


/*
 INPUT_TWICE
 */
"SMILE_INPUT_TWICE_TITLE" = "Set Passcode";


/*
 INPUT_THREE
 */
"SMILE_INPUT_THREE_TITLE" = "Change Passcode";
"SMILE_INPUT_THREE_STEP_1_DESCRIPTION" = "Enter your old %ld digit Passcode";
"SMILE_INPUT_THREE_STEP_2_DESCRIPTION" = "Enter your new %ld digit Passcode";
